#!/bin/bash

log="10.119.55.50 - - [2023-11-01T14:12:42+0300] \"GET /v1/api/statval HTTP/1.1\" 200 2062 0.009
10.111.55.50 - - [01/Nov/2023:14:12:45 +0300] \"GET /v1/api/statval HTTP/1.1\" 200 2062 0.009
10.119.55.50 - - [2023-11-01T14:12:45:42+0300] \"GET /v1/api/statval HTTP/1.1\" 200 2062 0.009
10.119.55.50 - - [2023-11-01T14:12:42:47+0300] \"GET /v1/api/statval HTTP/1.1\" 200 2062 0.009
10.119.55.50 - - [2023-11-01T14:12:42:48+0300] \"GET /v1/api/statval HTTP/1.1\" 200 2062 0.009
10.119.55.50 - - [2023-11-01T14:12:42:49+0300] \"GET /v1/api/statval HTTP/1.1\" 200 2062 0.009
10.111.55.50 - - [01/Nov/2023:14:12:50 +0300] \"GET /v1/api/statval HTTP/1.1\" 200 2062 0.009
10.111.55.50 - - [01/Nov/2023:14:12:51 +0300] \"GET /v1/api/statval HTTP/1.1\" 200 2062 0.009
10.111.55.50 - - [01/Nov/2023:14:12:55 +0300] \"GET /v1/api/statval HTTP/1.1\" 200 2062 0.009
10.119.55.50 - - [2023-11-01T14:12:42:57+0300] \"GET /v1/api/statval HTTP/1.1\" 200 2062 0.009"

pattern1="\[[0-9]{4}-[0-9]{2}-[0-9]{2}T[0-9]{2}:[0-9]{2}:[0-9]{2}"
pattern2="\[[0-9]{2}/[A-Za-z]{3}/[0-9]{4}:[0-9]{2}:[0-9]{2}:[0-9]{2}"

matches1=$(grep -Eo "$pattern1" <<< "$log" | wc -l)
matches2=$(grep -Eo "$pattern2" <<< "$log" | wc -l)

echo "Количество записей с форматом времени yyyy-mm-ddThh:mm:ss: $matches1"
echo "Количество записей с форматом времени dd/mm/yy:hh:mm:ss: $matches2"
